app/controllers/code_controller.rb

SELECT "codes".* FROM "codes" ORDER BY updated_at DESC
---
  def index
    @codes = Code.all.order('updated_at DESC')